Revit 2027 API
FabricationPart.Alias Property
 The alias of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Alias { get; }
Public ReadOnly Property Alias As String
	Get
public:
property String^ Alias {
	String^ get ();
}
member Alias : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace